<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"2034efd707e9d608a2a487ec1c6d4bf0da6f8b4857330a33eb697bc606048e7f","plan_job_ref":"Job Pull Request Checks #4770 at https://github.com/GSA-TTS/FAC/actions/runs/14738034446","plan_out_hash":"a3d146bde90a0ce9ba772eeb1b98d050a8be476edda287e8ad9eb6a1bcd91044","plan_hash":"73bbf741779034e5a6dbddce3d7cda44f1d04eb883a7f29f8193cfe4f6cda07a","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 9 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2025-04-21T20:53:40Z" -> (known after apply)
!~      docker_image                = "ghcr.io/gsa-tts/fac/postgrest@sha256:b5c12243cbbe709021b4c5cc4936a1a0cc8bc828dfe4ed958ce65d756b127760" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:80cb7dbcf58efcc5d65ff0a62ef012a8cf3b9959b751d2a548132796468a9123"
!~      environment                 = {
!~          "PGRST_DB_SCHEMAS"   = "api_v1_0_3,api_v1_1_0,api_v1_2_0,admin_api_v1_1_0" -> "api_v1_1_0,api_v1_2_0,admin_api_v1_1_0"
#            (4 unchanged elements hidden)
        }
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "postgrest"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-production-postgrest.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2025-04-24T18:56:27Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "41e96938-1383-c2ce-3157-af85063feaa3"

-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873"
        }

#        (1 unchanged block hidden)
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "bffa4f44-73e2-295d-6c7e-2809a21406d6"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
        }
-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
        }
+       policy {
+           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "65fbd285-0a4b-cfbe-3445-d40cc279c621"

-       policy {
-           destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873"
        }

#        (1 unchanged block hidden)
    }

  # module.production.cloudfoundry_route.postgrest will be updated in-place
!~  resource "cloudfoundry_route" "postgrest" {
!~      destinations = [
-           {
-               app_id           = "4a9acf70-4f31-482b-8661-54ba4b5f7945" -> null
-               app_process_type = "web" -> null
-               id               = "632bd828-cee5-49a3-8a0e-546b0067cf5b" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "23442b6c-89d1-4d9c-b343-4a7e7145b545"
!~      updated_at   = "2025-04-21T20:53:48Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:3dea1e8936dc4df006e12224bd1eea11b8384d496d4deef7aa58b8ad4ef856e4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-24T18:57:22Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-25T18:12:26Z" -> (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:3dea1e8936dc4df006e12224bd1eea11b8384d496d4deef7aa58b8ad4ef856e4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-21T20:55:11Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-               app_process_type = "web" -> null
-               id               = "68e16414-09a5-4efc-b00a-6ec2344161a2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "5ae55cd7-5641-4974-a489-56a5cf2c7524"
!~      updated_at   = "2025-04-21T20:54:32Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-               app_process_type = "web" -> null
-               id               = "4e8300b8-ba93-4796-92e9-e71f3ac04b4e" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "cae74bec-d093-4827-bef4-009271f8da50"
!~      updated_at   = "2025-04-24T16:07:40Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 9 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4770](https://github.com/GSA-TTS/FAC/actions/runs/14738034446)